BUILD=build
ISO=نظام_العرب.iso
النواه=النواه.elf
ISO_DIR=iso
BACKGROUND=الخلفية.png

# =========================
# مسارات الهيدر (Header paths)
# =========================
INCLUDES = -I. -Iالنواه

# =========================
# خيارات الترجمة
# =========================
CFLAGS = -m64 -mno-red-zone -mcmodel=large \
         -ffreestanding -fno-stack-protector -fno-pie -fno-pic \
         -Wall -Wextra -Wno-unused-function \
         $(INCLUDES)

LDFLAGS = -m elf_x86_64 -T ربط_الملفات.ld

all: $(ISO)

# ================= الوسيط =================
النظام_المضغوط:
	rm -f الوسيط/النظام_المضغوط.tar
	cd أرض_المستخدم && tar -cf ../الوسيط/النظام_المضغوط.tar .

# ================= الوسيط =================
النظام/الوسيط.img: النظام_المضغوط
	mkdir -p boot
	cd الوسيط && find . | cpio -o -H newc > ../النظام/الوسيط.img

$(ISO): $(النواه) النظام/الوسيط.img
	mkdir -p $(ISO_DIR)/boot/grub
	mkdir -p $(ISO_DIR)/النظام/
	mkdir -p $(ISO_DIR)/أرض_المستخدم/boot
	mkdir -p $(ISO_DIR)/boot/الخطوط
	mkdir -p $(ISO_DIR)/أرض_المستخدم/النظام/النواه

	cp boot/grub/grub.cfg $(ISO_DIR)/boot/grub/
	cp boot/$(BACKGROUND) $(ISO_DIR)/boot/
	cp boot/الخطوط/الخط.pf2 $(ISO_DIR)/boot/الخطوط/
	cp boot/$(النواه) $(ISO_DIR)/boot/
	cp النظام/الوسيط.img $(ISO_DIR)/النظام/
	cp boot/$(النواه) $(ISO_DIR)/أرض_المستخدم/boot/

	cp -r أرض_المستخدم/* $(ISO_DIR)/أرض_المستخدم/

	grub-mkrescue -o $(ISO) $(ISO_DIR)

$(النواه): 
	mkdir -p $(BUILD)

	nasm -f elf64 boot/multiboot.asm -o $(BUILD)/multiboot.o
	# Core
	gcc $(CFLAGS) -c النواه/النواه.c -o $(BUILD)/النواه.o
	gcc $(CFLAGS) -c النواه/القلب/الجوهرة.c -o $(BUILD)/الجوهرة.o


	# مكتبة_المحركات
	gcc $(CFLAGS) -c النواه/مكتبة_المحركات/مكتبة_معالجة_النصوص.c -o $(BUILD)/مكتبة_معالجة_النصوص.o

	# محرك_التطبيقات
	gcc $(CFLAGS) -c النواه/محرك_التطبيقات/محرك_التطبيقات.c -o $(BUILD)/محرك_التطبيقات.o


	# صيغة bin
	gcc $(CFLAGS) -c النواه/محرك_التطبيقات/الصيغ/bin/bin_format.c -o $(BUILD)/bin_format.o


	# محرك_الذاكرة
	gcc $(CFLAGS) -c النواه/محرك_الذاكرة/بوابة_الذاكرة.c -o $(BUILD)/بوابة_الذاكرة.o
	gcc $(CFLAGS) -c النواه/محرك_الذاكرة/محرك_الذاكرة.c -o $(BUILD)/محرك_الذاكرة.o
	gcc $(CFLAGS) -c النواه/محرك_الذاكرة/مدير_الكومة/مدير_الكومة.c -o $(BUILD)/مدير_الكومة.o
	gcc $(CFLAGS) -c النواه/محرك_الذاكرة/مدير_الصفحات/مدير_الصفحات.c -o $(BUILD)/مدير_الصفحات.o

	# محرك_العمليات
	gcc $(CFLAGS) -c النواه/محرك_العمليات/بوابة_العمليات.c -o $(BUILD)/بوابة_العمليات.o
	gcc $(CFLAGS) -c النواه/محرك_العمليات/محرك_العمليات.c -o $(BUILD)/محرك_العمليات.o

	# محرك_ربط_العمليات
	gcc $(CFLAGS) -c النواه/محرك_ربط_العمليات/بوابة_النواه.c -o $(BUILD)/بوابة_النواه.o
	gcc $(CFLAGS) -c النواه/محرك_ربط_العمليات/محرك_ربط_العمليات.c -o $(BUILD)/محرك_ربط_العمليات.o
	gcc $(CFLAGS) -c النواه/محرك_ربط_العمليات/مُدير_التواصل/مُدير_التواصل.c -o $(BUILD)/مُدير_التواصل.o

	# محرك_الجدولة--------------------------------------------------------------------------------------------------------------------
	gcc $(CFLAGS) -c النواه/محرك_الجدولة/بوابة_الجدولة.c -o $(BUILD)/بوابة_الجدولة.o
	gcc $(CFLAGS) -c النواه/محرك_الجدولة/محرك_الجدولة.c -o $(BUILD)/محرك_الجدولة.o
	gcc $(CFLAGS) -c النواه/محرك_الجدولة/مُدير_راحة_العمليات/مُدير_راحة_العمليات.c -o $(BUILD)/مُدير_راحة_العمليات.o
	gcc $(CFLAGS) -c النواه/محرك_الجدولة/مُدير_الأحداث/مُدير_الأحداث.c -o $(BUILD)/مُدير_الأحداث.o
	gcc $(CFLAGS) -c النواه/محرك_الجدولة/مُدير_قائمة_الأنتظار/مُدير_قائمة_الأنتظار.c -o $(BUILD)/مُدير_قائمة_الأنتظار.o
	
	# محرك_المقاطعات-----------------------------------------------------------------------------------------------------------------
	gcc $(CFLAGS) -c النواه/محرك_المقاطعات/بوابة_المقاطعات.c -o $(BUILD)/بوابة_المقاطعات.o
	gcc $(CFLAGS) -c النواه/محرك_المقاطعات/أدارة_تنظيم_المقاطعات/مُدير_جدول_المقاطعات.c -o $(BUILD)/مُدير_جدول_المقاطعات.o
	gcc $(CFLAGS) -c النواه/محرك_المقاطعات/أدارة_تنظيم_المقاطعات/مُعالج_IRQ.c -o $(BUILD)/مُعالج_IRQ.o
	gcc $(CFLAGS) -c النواه/محرك_المقاطعات/الأداره_المتقدمة_للمقاطعات/مُتحكم_المقاطعات.c -o $(BUILD)/مُتحكم_المقاطعات.o
	gcc $(CFLAGS) -c النواه/محرك_المقاطعات/الأداره_المتقدمة_للمقاطعات/مُتحكم_وموجه_المقاطعات.c -o $(BUILD)/مُتحكم_وموجه_المقاطعات.o
	nasm -f elf64 النواه/محرك_المقاطعات/أدارة_تنظيم_المقاطعات/معالج_خدمات_المقاطعات.asm -o $(BUILD)/معالج_خدمات_المقاطعات.o
	nasm -f elf64 النواه/محرك_المقاطعات/أدارة_تنظيم_المقاطعات/مُحمل_جدول_واصفات_المقاطعات.asm -o $(BUILD)/مُحمل_جدول_واصفات_المقاطعات.o
	nasm -f elf64 النواه/محرك_المقاطعات/أدارة_تنظيم_المقاطعات/مُبدل_الحالة.asm -o $(BUILD)/مُبدل_الحالة.o

	# محرك_الفيديو
	gcc $(CFLAGS) -c النواه/محرك_الفيديو/بوابة_الفيديو.c -o $(BUILD)/بوابة_الفيديو.o
	gcc $(CFLAGS) -c النواه/محرك_الفيديو/محرك_الفيديو.c -o $(BUILD)/محرك_الفيديو.o

    # خدمات_المستخدم-------------------------------------------!!!!بدون(عزل_حقيقي_فقط_بوابات).

	# محرك_العرض--------------------------------------------------------------------------------------------------------------------
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/الخدمات/محرك_العرض/بوابة_محرك_العرض.c -o $(BUILD)/بوابة_محرك_العرض.o
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/الخدمات/محرك_العرض/محرك_العرض.c -o $(BUILD)/محرك_العرض.o
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/الخدمات/محرك_العرض/مدير_النوافذ/مدير_التركيب_الرسومي/مدير_التركيب_الرسومي.c -o $(BUILD)/مدير_التركيب_الرسومي.o
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/الخدمات/محرك_العرض/مدير_النوافذ/مدير_النوافذ.c -o $(BUILD)/مدير_النوافذ.o
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/الخدمات/محرك_العرض/مدير_الرسم/مدير_الرسم.c -o $(BUILD)/مدير_الرسم.o
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/الخدمات/محرك_العرض/مدير_الرسم/الخط.c -o $(BUILD)/الخط.o
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/الخدمات/محرك_العرض/اداره_محرك_العرض/مدير_الخلفية/مدير_الخلفية.c -o $(BUILD)/مدير_الخلفية.o
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/الخدمات/محرك_العرض/مدير_النوافذ/مدير_اطارات_النوافذ/مدير_اطارات_النوافذ.c -o $(BUILD)/مدير_اطارات_النوافذ.o
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/الخدمات/محرك_العرض/مدير_النوافذ/مدير_عرض_النصوص/مدير_عرض_النصوص.c -o $(BUILD)/مدير_عرض_النصوص.o

	# محرك_التعريفات------------------------------------------------------------------------------------------------------------------
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/الخدمات/محرك_التعريفات/بوابة_محرك_التعريفات.c -o $(BUILD)/بوابة_محرك_التعريفات.o
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/الخدمات/محرك_التعريفات/محرك_التعريفات.c -o $(BUILD)/محرك_التعريفات.o
	# محرك_انظمة_الملفات--------------------------------------------------------------------------------------------------------------
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/الخدمات/محرك_انظمة_الملفات/محرك_انظمة_الملفات.c -o $(BUILD)/محرك_انظمة_الملفات.o
    #التعريفات------------------------------------------------------------------------------------------------------------------------

	#الفأرة--------------------------------------------------------------------------------------------------------------------------
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/التعريفات/مؤشرات_الفأرة/مؤشر_الفأرة_الافتراضي/مؤشر_الفأرة_الافتراضية.c -o $(BUILD)/مؤشر_الفأرة_الافتراضية.o
	#لوحة_المفاتيح---------------------------------------------------------------------------------------------------------------------
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/التعريفات/لوحات_المفاتيح/لوحة_المفاتيح_الافتراضية/لوحة_المفاتيح_الافتراضية.c -o $(BUILD)/لوحة_المفاتيح_الافتراضية.o
	#التخزين-------------------------------------------------------------------------------------------------------------------------
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/التعريفات/التخزين/ATA/ata.c -o $(BUILD)/ata.o

	#المؤقت-------------------------------------------------------------------------------------------------------------------------
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/التعريفات/المؤقت/المؤقت.c -o $(BUILD)/المؤقت.o

    #انظمة_الملفات---------------------------------------------------------------------------------------------------------------------

	#نظام_العرب----------------------------------------------------------------------------------------------------------------------
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/التعريفات/أنظمة_الملفات/نظام_العرب/نظام_العرب.c -o $(BUILD)/نظام_العرب.o

	# مجلدات
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/التعريفات/أنظمة_الملفات/نظام_العرب/المجلدات/المجلدات.c -o $(BUILD)/المجلدات.o

	# مسارات
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/التعريفات/أنظمة_الملفات/نظام_العرب/المسارات/المسارات.c -o $(BUILD)/المسارات.o

	# قرائة
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/التعريفات/أنظمة_الملفات/نظام_العرب/القراءة/القراءة.c -o $(BUILD)/القراءة.o

	# كتابة
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/التعريفات/أنظمة_الملفات/نظام_العرب/الكتابة/الكتابة.c -o $(BUILD)/الكتابة.o

	# ملفات
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/التعريفات/أنظمة_الملفات/نظام_العرب/الملفات/الملفات.c -o $(BUILD)/الملفات.o

	# تهيئة
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/التعريفات/أنظمة_الملفات/نظام_العرب/التهيئة/التهيئة.c -o $(BUILD)/التهيئة.o

	# عقدة
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/التعريفات/أنظمة_الملفات/نظام_العرب/العقدة/العقدة.c -o $(BUILD)/العقدة.o

	# كتلة
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/التعريفات/أنظمة_الملفات/نظام_العرب/الكتلة/الكتلة.c -o $(BUILD)/الكتلة.o

	# عام
	gcc $(CFLAGS) -c أرض_المستخدم/النظام/التعريفات/أنظمة_الملفات/نظام_العرب/التعريف_العام/التعريف_العام.c -o $(BUILD)/التعريف_العام.o

	ld $(LDFLAGS) -o boot/$(النواه) $(BUILD)/*.o

# هدف منفصل للتشغيل
run: $(ISO)
	qemu-system-x86_64 -m 2G \
	    -enable-kvm \
	    -bios /usr/share/ovmf/OVMF.fd \
	    -cdrom $(ISO) \
	    -vga virtio \
	    -display gtk,zoom-to-fit=on \
	    -machine pc,accel=kvm \
	    -global ICH9-LPC.disable_s3=1 \
	    -global ICH9-LPC.disable_s4=1

debug: $(ISO)
	qemu-system-x86_64 -m 2G \
	    -bios /usr/share/ovmf/OVMF.fd \
	    -cdrom $(ISO) \
	    -no-reboot -no-shutdown \
	    -d int,mmu,guest_errors,cpu_reset \
	    -D qemu.log \
	    -serial stdio \
	    -display gtk \
	    -vga std

clean:
	rm -rf $(ISO_DIR)
	rm -f $(ISO)
	rm -f boot/$(النواه)
	rm -f النظام/الوسيط.img
	rm -f الوسيط/النظام_المضغوط.tar
	rm -rf $(BUILD)

.PHONY: all clean run النظام_المضغوط
